<?php 
/*
0. Тег <meta charset="UTF-8"> не забудьте подключить
1. Создайте класс User, который содержит:
1.1. объявите 2 публичные переменные в нем (не задавая значений):
$name;
$age;
1.2. функцию writeNameAge(), которая выводит на экран Ваше имя и Возраст.
1.3. Создайте экземпляр класса User - $ekzUser.
1.4. Задайте переменной $name = 'Свое_имя';
1.5. Задайте переменной $age = Свой_возраст;
1.6. Вызовите функцию writeNameAge().

2. Создайте класс Student, который наследуется от класса User.
2.1. объявите переменную $school со значением 'it-school'.
2.2. объявите функцию checkSchool(), которая проверяет: если значение переменной $school == 'it-school', то выводит на экран 'Я учусь в it-school'
2.3. Создайте экземпляр класса Student - $ekzStudent.
2.4. Вызовите у экземпляра класса Student функцию checkSchool().
*/
 ?>